W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find_by(id: params[:id])

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "Oreo3"], ["sex", "F"], ["description", "    a tuxedo cat\r\nthat is also green"], ["updated_at", "2022-05-27 23:04:55.846573"], ["id", 5]]
---
    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @cat = Cat.find_by(id: params[:id])