W11D2/Todos/todos_app/app/controllers/api/todos_controller.rb

    def index
        todos = Todo.all
---
SELECT "todos".* FROM "todos"

    def create
        @todo = Todo.new(todo_params)

        if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "adfsadf"], ["body", "asdsfsdf"], ["done", false], ["created_at", "2022-07-01 00:04:17.724428"], ["updated_at", "2022-07-01 00:04:17.724428"]]