W5D4/URLShortener/app/models/shortened_url.rb

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_link" = $1 LIMIT $2  [["short_link", "o3c040ZLdTwwubr-zKwG2Q"], ["LIMIT", 1]]
---
  def self.random_code
    li = SecureRandom.urlsafe_base64
    until !ShortenedUrl.exists?(:short_link => li) #until ShortenedUrl.exists?(:short_link => li) == false

INSERT INTO "shortened_urls" ("long_link", "short_link", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
def self.factory_create(user, long_url)
    short_url = ShortenedUrl.random_code
    short = ShortenedUrl.create!(long_link: long_url, short_link: short_url, user_id: user.id)