W5D4/URLShortener/app/models/visit.rb

    def self.record_visit!(user,shortened_url)
        v = Visit.create!(user_id: user.id, short_url_id: shortened_url.id )
---
INSERT INTO "visits" ("user_id", "short_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["short_url_id", 8], ["created_at", "2022-05-20 05:58:27.226149"], ["updated_at", "2022-05-20 05:58:27.226149"]]